* Using multi-valued properties in org
  :PROPERTIES:
  :KEYWORDS: a b c%20d e-f
  :END:

#+BEGIN_SRC emacs-lisp
(org-entry-put-multivalued-property (point) "KEYWORDS" "a" "b" "c d" "e-f")
#+END_SRC

#+RESULTS:
| a | b | c d | e-f |

#+BEGIN_SRC emacs-lisp
(org-entry-member-in-multivalued-property (point) "KEYWORDS" "c d")
#+END_SRC

#+RESULTS:
| c%20d | e-f |

#+BEGIN_SRC emacs-lisp
(org-entry-add-to-multivalued-property (point) "KEYWORDS" "a\nb")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(org-entry-remove-from-multivalued-property (point) "KEYWORDS" "c d")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC emacs-lisp
(org-entry-get-multivalued-property (point) "KEYWORDS")
#+END_SRC

#+RESULTS:
| a | b | e-f | a |

#+BEGIN_SRC emacs-lisp
(org-map-entries (lambda () (org-entry-get (point) "KEYWORDS")) "KEYWORDS={c d}")
#+END_SRC

#+RESULTS:

